RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_hppass_csg.h
#if !defined(CY_HPPASS_CSG_H)
#define CY_HPPASS_CSG_H

#include "cy_device.h"

#ifdef CY_IP_MXS40MCPASS

#include "cy_hppass_ac.h"

#if defined(__cplusplus)
extern "C" {
#endif

/** \addtogroup group_hppass_csg_macros
* \{
*/

/** The number of CSG LUT registers */
#define CY_HPPASS_CSG_LUT_NUM       (2UL)

/** The number of CSG LUT data entries */
#define CY_HPPASS_CSG_LUT_SIZE      (128UL)

/** The maximum value of CSG DAC_VAL */
#define CY_HPPASS_CSG_DAC_VAL_MAX   (1023U)

/** \addtogroup group_csg_cmp_interrupts
 *  To be used with \ref Cy_HPPASS_Comp_GetInterruptStatus,
 *                  \ref Cy_HPPASS_Comp_GetInterruptStatusMasked,
 *                  \ref Cy_HPPASS_Comp_SetInterrupt,
 *                  \ref Cy_HPPASS_Comp_ClearInterrupt,
 *                  \ref Cy_HPPASS_Comp_SetInterruptMask,
 *                  \ref Cy_HPPASS_Comp_GetInterruptMask
 *  \{
 */
#define CY_HPPASS_INTR_CSG_0_CMP    (0x01U) /**< CSG 0 comparator interrupt mask */
#define CY_HPPASS_INTR_CSG_1_CMP    (0x02U) /**< CSG 1 comparator interrupt mask */
#define CY_HPPASS_INTR_CSG_2_CMP    (0x04U) /**< CSG 2 comparator interrupt mask */
#define CY_HPPASS_INTR_CSG_3_CMP    (0x08U) /**< CSG 3 comparator interrupt mask */
#define CY_HPPASS_INTR_CSG_4_CMP    (0x10U) /**< CSG 4 comparator interrupt mask */

#define CY_HPPASS_INTR_CSG_CMP      (HPPASS_CSG_CMP_INTR_CMP_Msk) /**< Comparator interrupt mask */
/** \} group_csg_cmp_interrupts */


/** \addtogroup group_csg_dac_interrupts
 *  To be used with \ref Cy_HPPASS_DAC_GetInterruptStatus,
 *                  \ref Cy_HPPASS_DAC_GetInterruptStatusMasked,
 *                  \ref Cy_HPPASS_DAC_SetInterrupt,
 *                  \ref Cy_HPPASS_DAC_ClearInterrupt,
 *                  \ref Cy_HPPASS_DAC_SetInterruptMask,
 *                  \ref Cy_HPPASS_DAC_GetInterruptMask
 *  \{
 */
#define CY_HPPASS_INTR_CSG_0_DAC_HW_START   (0x01UL) /**< CSG 0 DAC HW start interrupt mask */
#define CY_HPPASS_INTR_CSG_1_DAC_HW_START   (0x02UL) /**< CSG 1 DAC HW start interrupt mask */
#define CY_HPPASS_INTR_CSG_2_DAC_HW_START   (0x04UL) /**< CSG 2 DAC HW start interrupt mask */
#define CY_HPPASS_INTR_CSG_3_DAC_HW_START   (0x08UL) /**< CSG 3 DAC HW start interrupt mask */
#define CY_HPPASS_INTR_CSG_4_DAC_HW_START   (0x10UL) /**< CSG 4 DAC HW start interrupt mask */

#define CY_HPPASS_INTR_CSG_DAC_HW_START     (HPPASS_CSG_DAC_INTR_DAC_HW_START_Msk) /**< DAC HW start interrupt mask */

#define CY_HPPASS_INTR_CSG_0_DAC_SLOPE_DONE (0x0100UL) /**< CSG 0 DAC SLOPE/LUT done interrupt mask */
#define CY_HPPASS_INTR_CSG_1_DAC_SLOPE_DONE (0x0200UL) /**< CSG 1 DAC SLOPE/LUT done interrupt mask */
#define CY_HPPASS_INTR_CSG_2_DAC_SLOPE_DONE (0x0400UL) /**< CSG 2 DAC SLOPE/LUT done interrupt mask */
#define CY_HPPASS_INTR_CSG_3_DAC_SLOPE_DONE (0x0800UL) /**< CSG 3 DAC SLOPE/LUT done interrupt mask */
#define CY_HPPASS_INTR_CSG_4_DAC_SLOPE_DONE (0x1000UL) /**< CSG 4 DAC SLOPE/LUT done interrupt mask */

#define CY_HPPASS_INTR_CSG_DAC_SLOPE_DONE   (HPPASS_CSG_DAC_INTR_DAC_SLOPE_DONE_Msk) /**< DAC SLOPE/LUT done interrupt mask */

#define CY_HPPASS_INTR_CSG_0_DAC_BUF_EMPTY  (0x010000UL) /**< CSG 0 DAC empty buffer interrupt mask */
#define CY_HPPASS_INTR_CSG_1_DAC_BUF_EMPTY  (0x020000UL) /**< CSG 1 DAC empty buffer interrupt mask */
#define CY_HPPASS_INTR_CSG_2_DAC_BUF_EMPTY  (0x040000UL) /**< CSG 2 DAC empty buffer interrupt mask */
#define CY_HPPASS_INTR_CSG_3_DAC_BUF_EMPTY  (0x080000UL) /**< CSG 3 DAC empty buffer interrupt mask */
#define CY_HPPASS_INTR_CSG_4_DAC_BUF_EMPTY  (0x100000UL) /**< CSG 4 DAC empty buffer interrupt mask */

#define CY_HPPASS_INTR_CSG_DAC_BUF_EMPTY    (HPPASS_CSG_DAC_INTR_DAC_BUF_EMPTY_Msk) /**< DAC empty buffer interrupt mask */

/** Combined DAC interrupt mask */
#define CY_HPPASS_INTR_CSG_DAC              (HPPASS_CSG_DAC_INTR_DAC_HW_START_Msk | \
                                             HPPASS_CSG_DAC_INTR_DAC_SLOPE_DONE_Msk | \
                                             HPPASS_CSG_DAC_INTR_DAC_BUF_EMPTY_Msk)
/** \} group_csg_dac_interrupts */

/** \} group_hppass_csg_macros */


/***************************************
*       Enumerated Types
***************************************/

/**
* \addtogroup group_hppass_csg_enums
* \{
*/

/** The positive comparator input selection */
typedef enum
{
    CY_HPPASS_COMP_POS_A   = 0U, /**< Analog input PA */
    CY_HPPASS_COMP_POS_B   = 1U, /**< Analog input PB */
} cy_en_hppass_comp_pos_t;


/** The negative comparator input selection */
typedef enum
{
    CY_HPPASS_COMP_NEG_DAC = 0U, /**< DAC is negative input */
    CY_HPPASS_COMP_NEG_A   = 2U, /**< Analog input NA */
    CY_HPPASS_COMP_NEG_B   = 3U, /**< Analog input NB */
} cy_en_hppass_comp_neg_t;


/** The blanking mode selection */
typedef enum
{
    CY_HPPASS_COMP_BLANK_DISABLED = 0U, /**< Comparator output is not gated */
    CY_HPPASS_COMP_BLANK_TRIG_HI  = 1U, /**< Comparator output is gated to 0 by a high trigger level */
    CY_HPPASS_COMP_BLANK_TRIG_LO  = 2U, /**< Comparator output is gated to 0 by a low trigger level */
} cy_en_hppass_comp_blank_t;


/** The comparator blanking trigger selection */
typedef enum
{
    CY_HPPASS_COMP_TRIG_DISABLED = 0U,  /**< Disabled */
    CY_HPPASS_COMP_TRIG_0        = 1U,  /**< Trigger 0 */
    CY_HPPASS_COMP_TRIG_1        = 2U,  /**< Trigger 1 */
    CY_HPPASS_COMP_TRIG_2        = 3U,  /**< Trigger 2 */
    CY_HPPASS_COMP_TRIG_3        = 4U,  /**< Trigger 3 */
    CY_HPPASS_COMP_TRIG_4        = 5U,  /**< Trigger 4 */
    CY_HPPASS_COMP_TRIG_5        = 6U,  /**< Trigger 5 */
    CY_HPPASS_COMP_TRIG_6        = 7U,  /**< Trigger 6 */
    CY_HPPASS_COMP_TRIG_7        = 8U,  /**< Trigger 7 */
} cy_en_hppass_comp_trig_t;


/** The comparator output signal mode for Interrupt generation and AC status */
typedef enum
{
    CY_HPPASS_COMP_EDGE_DISABLED = 0U, /**< Disabled, no interrupts will be asserted */
    CY_HPPASS_COMP_EDGE_RISING   = 1U, /**< Rising edge */
    CY_HPPASS_COMP_EDGE_FALLING  = 2U, /**< Falling edge */
    CY_HPPASS_COMP_EDGE_BOTH     = 3U, /**< Both rising and falling edges */
} cy_en_hppass_comp_edge_t;


