RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_hppass_csg.h
/** DAC start trigger source selection */
typedef enum
{
    CY_HPPASS_DAC_START_DISABLED = 0U, /**< Disabled */
    CY_HPPASS_DAC_START_TRIG_0   = 1U, /**< Trigger 0 */
    CY_HPPASS_DAC_START_TRIG_1   = 2U, /**< Trigger 1 */
    CY_HPPASS_DAC_START_TRIG_2   = 3U, /**< Trigger 2 */
    CY_HPPASS_DAC_START_TRIG_3   = 4U, /**< Trigger 3 */
    CY_HPPASS_DAC_START_TRIG_4   = 5U, /**< Trigger 4 */
    CY_HPPASS_DAC_START_TRIG_5   = 6U, /**< Trigger 5 */
    CY_HPPASS_DAC_START_TRIG_6   = 7U, /**< Trigger 6 */
    CY_HPPASS_DAC_START_TRIG_7   = 8U, /**< Trigger 7 */
    CY_HPPASS_DAC_START_AC       = 9U  /**< Autonomous Controller */
} cy_en_hppass_dac_start_t;


/** DAC update trigger source selection */
typedef enum
{
    CY_HPPASS_DAC_UPDATE_DISABLED     = 0U,  /**< Disabled */
    CY_HPPASS_DAC_UPDATE_TRIG_0       = 1U,  /**< Trigger 0 */
    CY_HPPASS_DAC_UPDATE_TRIG_1       = 2U,  /**< Trigger 1 */
    CY_HPPASS_DAC_UPDATE_TRIG_2       = 3U,  /**< Trigger 2 */
    CY_HPPASS_DAC_UPDATE_TRIG_3       = 4U,  /**< Trigger 3 */
    CY_HPPASS_DAC_UPDATE_TRIG_4       = 5U,  /**< Trigger 4 */
    CY_HPPASS_DAC_UPDATE_TRIG_5       = 6U,  /**< Trigger 5 */
    CY_HPPASS_DAC_UPDATE_TRIG_6       = 7U,  /**< Trigger 6 */
    CY_HPPASS_DAC_UPDATE_TRIG_7       = 8U,  /**< Trigger 7 */
    CY_HPPASS_DAC_UPDATE_AC           = 9U,  /**< Autonomous Controller */
    CY_HPPASS_DAC_UPDATE_PERIOD_TC    = 10U, /**< Period terminal count */
    CY_HPPASS_DAC_UPDATE_COMP_LVL     = 11U, /**< Comparator output */
    CY_HPPASS_DAC_UPDATE_COMP_LVL_INV = 12U  /**< Inverted comparator output */
} cy_en_hppass_dac_update_t;


/** DAC mode selection */
typedef enum
{
    CY_HPPASS_DAC_MODE_BUFFERED      = 0U, /**< Single Value Buffered Mode */
    CY_HPPASS_DAC_MODE_HYSTERETIC    = 1U, /**< Two Value Hysteretic Buffered Mode */
    CY_HPPASS_DAC_MODE_SLOPE_RISING  = 2U, /**< Rising Slope Mode */
    CY_HPPASS_DAC_MODE_SLOPE_FALLING = 3U, /**< Falling Slope Mode */
    CY_HPPASS_DAC_MODE_SLOPE_TRIANG  = 4U, /**< Triangular Slope Mode */
    CY_HPPASS_DAC_MODE_LUT_FORWARD   = 5U, /**< LUT Forward Mode */
    CY_HPPASS_DAC_MODE_LUT_REVERSE   = 6U, /**< LUT Reverse Mode */
    CY_HPPASS_DAC_MODE_LUT_FWD_REV   = 7U  /**< LUT Forward Reverse Mode */
} cy_en_hppass_dac_mode_t;


/** DAC HW/FW start/stop command mode selection */
typedef enum
{
    CY_HPPASS_DAC_HW = 0U,
    CY_HPPASS_DAC_FW = 1U
} cy_en_hppass_dac_cmd_t;


/** The DAC output selection for the SAR measurement */
typedef enum
{
    CY_HPPASS_DAC_OUT_DISABLED = 0U,  /**< Disabled */
    CY_HPPASS_DAC_OUT_0        = 1U,  /**< DAC 0 */
    CY_HPPASS_DAC_OUT_1        = 2U,  /**< DAC 1 */
    CY_HPPASS_DAC_OUT_2        = 3U,  /**< DAC 2 */
    CY_HPPASS_DAC_OUT_3        = 4U,  /**< DAC 3 */
    CY_HPPASS_DAC_OUT_4        = 5U,  /**< DAC 4 */
} cy_en_hppass_dac_out_t;


/** \} group_hppass_csg_enums */

/***************************************
*       Configuration Structures
***************************************/

/**
* \addtogroup group_hppass_csg_data_structures
* \{
*/


/** The Comparator configuration structure */
typedef struct
{
    cy_en_hppass_comp_pos_t pos;        /**< Comparator Positive Input selection */
    cy_en_hppass_comp_neg_t neg;        /**< Comparator Negative Input selection */
    cy_en_hppass_comp_blank_t blank;    /**< Comparator Blanking Mode.
                                         *   Select a level input trigger from CMP_BLANK_TR_SEL
                                         *   to gate the comparators output of this slice to 0.
                                         *   Polarity of active signal is selectable.
                                         */
    cy_en_hppass_comp_trig_t trig;      /**< Comparator Blanking Trigger selection */
    cy_en_hppass_comp_edge_t edge;      /**< Comparator signal mode for Interrupt generation and AC status */
    bool invert;                        /**< Inversion of the comparator output:
                                         *   - false: direct output
                                         *   - true: inverted output
                                         */
} cy_stc_hppass_comp_t;


/** The DAC period configuration structure */
typedef struct
{
    uint8_t frac;   /**< 5-bit fractional divide value */
    uint16_t intg;  /**< 12-bit integer divide value */
} cy_stc_hppass_dac_period_t;


/** The DAC configuration structure */
typedef struct
{
    cy_en_hppass_dac_start_t start;     /**< DAC trigger start. If input trigger is selected, it should be
                                         *  in the pulse mode.
                                         */
    cy_en_hppass_dac_update_t update;   /**< DAC trigger update. If input trigger is selected, it should be
                                         *   in the pulse mode
                                         */
    cy_en_hppass_dac_mode_t mode;       /**< DAC mode */
    bool continuous;                    /**< Continuous mode. (Only valid for Slope and LUT modes) */
    bool skipTrig;                      /**< Skip the first DAC hardware update trigger after the proper
                                         *   \ref cy_stc_hppass_dac_t::mode is enabled
                                         */
    bool cascade;                       /**< Synchronize parameter update with previous CSG slice in the
                                         *   case of multi-phase operation
                                         */
    bool paramSync;                     /**< Parameter Synchronization enable. If set, the DAC parameters will be
                                         *   set only after \ref Cy_HPPASS_DAC_SetParamSyncReady function call
                                         */
    uint8_t deGlitch;                   /**< DAC de-glitch time in clock cycles.
                                         *   Valid range 0..7 (0 means de-glitching is disabled, 1..7 - de-glitching
                                         *   period in cycles). The de-glitch period should be not grater than the DAC
                                         *   update period.
                                         */
    uint8_t stepSize;                   /**< Static value of 6 bit DAC Step Size. Valid range: 1..64 */
    uint16_t valBuffA;                  /**< DAC A value, usage depends on cy_stc_hppass_dac_t::mode.
                                         *   * Buffered mode - DAC value
                                         *   * Hysteretic Buffered mode - DAC high threshold
                                         *   * Slope modes - DAC start value
                                         *   * LUT modes - LUT start address
                                         */
    uint16_t valBuffB;                  /**< DAC B value, usage depends on cy_stc_hppass_dac_t::mode.
                                         *   * Buffered mode - DAC value
                                         *   * Hysteretic Buffered mode - DAC low threshold
                                         *   * Slope modes - DAC stop value
                                         *   * LUT modes - LUT stop address
                                         */
    cy_stc_hppass_dac_period_t period;   /**< DAC Period divider, clocked from CSG clock */
} cy_stc_hppass_dac_t;


