RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_hppass_csg.h
/** The CSG Slice configuration structure */
typedef struct
{
    cy_stc_hppass_comp_t comp;  /**< The Comparator configuration structure */
    cy_stc_hppass_dac_t dac;    /**< The DAC configuration structure */
} cy_stc_hppass_slice_t;


/** The CSG LUT configuration structure */
typedef struct
{
    uint16_t * waveform;    /**< The pointer to array of LUT data words.
                             *   May be NULL if LUT is not used.
                             */
    uint8_t sampleNum;      /**< The number of LUT data words.
                             *   The valid range is 1..\ref CY_HPPASS_CSG_LUT_SIZE.
                             *   The value is ignored if LUT is not used.
                             */
} cy_stc_hppass_lut_t;


/** The Comparator slope generator configuration structure */
typedef struct
{
    cy_stc_hppass_slice_t const * slice[CY_HPPASS_CSG_NUM]; /**< The array of the Slice configuration
                                                             *   structures \ref cy_stc_hppass_slice_t.
                                                             *   May contain NULL pointers for unused Slices
                                                             */
    cy_stc_hppass_lut_t const * lut[CY_HPPASS_CSG_LUT_NUM]; /**< The array of the LUT configuration
                                                             *   structures \ref cy_stc_hppass_lut_t.
                                                             *   May contain NULL pointers for unused LUTs
                                                             */
    cy_en_hppass_dac_out_t dacOut;  /**< DAC output selection for the SAR measurement */
} cy_stc_hppass_csg_t;

/** \} group_hppass_csg_data_structures */


/** \cond Parameter validation macros */
#define CY_HPPASS_CSG_SLICE_NUM_VALID(slcIdx)       (CY_HPPASS_CSG_NUM > (slcIdx))
#define CY_HPPASS_CSG_DAC_STEP_VALID(dacStep)       (64U >= (dacStep) && (0U < (dacStep)))
#define CY_HPPASS_CSG_LUT_ADDR_VALID(lutAddr)       (CY_HPPASS_CSG_LUT_SIZE > (lutAddr))
#define CY_HPPASS_CSG_PERIOD_FRAC_VALID(periodFrac) (32U > (periodFrac))
#define CY_HPPASS_CSG_PERIOD_INTG_VALID(periodIntg) ((4096U >= (periodIntg)) && (0U < (periodIntg)))
#define CY_HPPASS_CSG_DAC_VAL_VALID(dacVal)         (1023U >= (dacVal))
/** \endcond */


/***************************************
*        Function Prototypes
***************************************/

/**
* \addtogroup group_hppass_csg_functions
* \{
*/


/*******************************************************************************
* Function Name: Cy_HPPASS_CSG_Init
****************************************************************************//**
*
* Loads the CSG configuration.
* Can be used after the \ref Cy_HPPASS_Init function to update the CSG settings.
*
* \note If AC is running the initialization of GSC block is not allowed
* (\ref CY_HPPASS_AC_INVALID_STATE will be returned).
*
* \note Since the 'block ready' status is combined SAR and CSG, this particular
* CSG function cannot be protected from reinitialization during active operation,
* so it is on user's responsibility when and from where to call this function to
* reinitialize the CSG block.
*
* \param csgCfg
* Pointer to the CSG configuration structure \ref cy_stc_hppass_csg_t.
* The pointer cannot be NULL.
*
* \return
* The combined status of all the configured slices initialization, \ref cy_en_hppass_status_t.
*
*******************************************************************************/
cy_rslt_t Cy_HPPASS_CSG_Init(const cy_stc_hppass_csg_t * csgCfg);


/*******************************************************************************
* Function Name: Cy_HPPASS_CSG_DeInit
****************************************************************************//**
*
* De-initializes the CSG block, returns register values to default.
*
*
*******************************************************************************/
void Cy_HPPASS_CSG_DeInit(void);


/*******************************************************************************
* Function Name: Cy_HPPASS_CSG_SliceConfig
****************************************************************************//**
*
* Configures comparator and DAC for the specified CSG slice.
*
* \note If AC is running this configuration is not allowed
* (\ref CY_HPPASS_AC_INVALID_STATE will be returned).
*
* \note If the DAC block is currently busy this configuration is not allowed
* (\ref CY_HPPASS_CSG_INVALID_STATE will be returned).
*
* \note Since the 'block ready' status is combined SAR and CSG, this particular
* CSG function cannot be protected from reinitialization during active operation,
* so it is on user's responsibility when and from where to call this function to
* reinitialize the CSG Slice.
*
* \param sliceIdx
* The CSG slice. Valid range: 0..4.
*
* \param slice
* Pointer to the CSG slice configuration structure \ref cy_stc_hppass_slice_t.
* The pointer cannot be NULL.
*
* \return
* Status of initialization, \ref cy_en_hppass_status_t.
*
*******************************************************************************/
cy_en_hppass_status_t Cy_HPPASS_CSG_SliceConfig(uint8_t sliceIdx, const cy_stc_hppass_slice_t * slice);


/*******************************************************************************
* Function Name: Cy_HPPASS_CSG_LoadWaveform
****************************************************************************//**
*
* Sets waveform data for the specified LUT.
*
* \param lutIdx
* The LUT index. Valid range: 0..1.
*
* \param dataIdx
* Start index of the waveform in the lookup table. Valid range: 0..127.
*
* \param numSamples
* Number of samples for the waveform. Valid range: 1..128.
* \note numSamples is not greater than the waveform array size.
* \note The sum of dataIdx and numSamples should be less or equal to 128.
*
* \param waveform
* The pointer to LUT data array, max size is 128. The pointer cannot be NULL.
*
* \return
* Status of initialization, \ref cy_en_hppass_status_t.
*
*******************************************************************************/
cy_en_hppass_status_t Cy_HPPASS_CSG_LoadWaveform(uint8_t lutIdx, uint8_t dataIdx, uint8_t numSamples, const uint16_t * waveform);


/**
* \addtogroup group_hppass_csg_dac
* \{
*/


