RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_hppass_csg.h
/*******************************************************************************
* Function Name: Cy_HPPASS_DAC_SetPeriod
****************************************************************************//**
*
* Sets DAC period buffer for the specified CSG slice.
*
* \param sliceIdx
* The CSG slice. Valid range: 0..4.
*
* \param period
* The DAC period.
* See \ref cy_stc_hppass_dac_period_t.
*
*******************************************************************************/
__STATIC_INLINE void Cy_HPPASS_DAC_SetPeriod(uint8_t sliceIdx, cy_stc_hppass_dac_period_t period)
{
    CY_ASSERT_L1(CY_HPPASS_CSG_SLICE_NUM_VALID(sliceIdx));
    CY_ASSERT_L2(CY_HPPASS_CSG_PERIOD_FRAC_VALID(period.frac));
    CY_ASSERT_L2(CY_HPPASS_CSG_PERIOD_INTG_VALID(period.intg));

    HPPASS_CSG_SLICE_DAC_PERIOD(HPPASS_BASE, sliceIdx) =
            _VAL2FLD(HPPASS_CSG_SLICE_DAC_PERIOD_PERIOD_FRAC, period.frac) |
            _VAL2FLD(HPPASS_CSG_SLICE_DAC_PERIOD_PERIOD_INT, (uint32_t)period.intg - 1UL);
}


/*******************************************************************************
* Function Name: Cy_HPPASS_DAC_SetParamSyncReady
****************************************************************************//**
*
* Sets the ready status of DAC parameter synchronized update
* for the specified CSG slice. Registers DAC_VAL_A, DAC_VAL_B, DAC_PERIOD and
* DAC_CFG.DAC_STEP will be updated simultaneously on a subsequent DAC trigger.
*
* \note This function requires the \ref cy_stc_hppass_dac_t::paramSync setting
* to be enabled.
*
* \param sliceIdx
* The CSG slice. Valid range: 0..4.
*
*******************************************************************************/
__STATIC_INLINE void Cy_HPPASS_DAC_SetParamSyncReady(uint8_t sliceIdx)
{
    CY_ASSERT_L1(CY_HPPASS_CSG_SLICE_NUM_VALID(sliceIdx));

    HPPASS_CSG_SLICE_DAC_PARAM_SYNC(HPPASS_BASE, sliceIdx) = HPPASS_CSG_SLICE_DAC_PARAM_SYNC_READY_Msk;
}


/*******************************************************************************
* Function Name: Cy_HPPASS_DAC_IsBusy
****************************************************************************//**
*
* Gets the DAC busy status of the specified CSG slice.
*
* \param sliceIdx
* The CSG slice. Valid range: 0..4.
*
* \return
* The DAC busy status.
*
*******************************************************************************/
__STATIC_INLINE bool Cy_HPPASS_DAC_IsBusy(uint8_t sliceIdx)
{
    CY_ASSERT_L1(CY_HPPASS_CSG_SLICE_NUM_VALID(sliceIdx));

    return _FLD2BOOL(HPPASS_CSG_SLICE_DAC_MODE_START_BUSY, HPPASS_CSG_SLICE_DAC_MODE_START(HPPASS_BASE, sliceIdx));
}


/*******************************************************************************
* Function Name: Cy_HPPASS_DAC_Start
****************************************************************************//**
*
* Set hardware start or FW start the DAC selected mode for the
* specified CSG slice.
*
* \param sliceIdx
* The CSG slice. Valid range: 0..4.
*
* \param command
* DAC start command mode.
* See \ref cy_en_hppass_dac_cmd_t.
*
*******************************************************************************/
__STATIC_INLINE void Cy_HPPASS_DAC_Start(uint8_t sliceIdx, cy_en_hppass_dac_cmd_t command)
{
    CY_ASSERT_L1(CY_HPPASS_CSG_SLICE_NUM_VALID(sliceIdx));

    HPPASS_CSG_SLICE_DAC_MODE_START(HPPASS_BASE, sliceIdx) =
        (CY_HPPASS_DAC_HW == command) ? (HPPASS_CSG_SLICE_DAC_MODE_START_HW_START_Msk) :
                                        (HPPASS_CSG_SLICE_DAC_MODE_START_FW_START_Msk);
}


/*******************************************************************************
* Function Name: Cy_HPPASS_DAC_Stop
****************************************************************************//**
*
* Stop the DAC selected mode for the specified CSG slice.
*
* \param sliceIdx
* The CSG slice. Valid range: 0..4.
*
*******************************************************************************/
__STATIC_INLINE void Cy_HPPASS_DAC_Stop(uint8_t sliceIdx)
{
    CY_ASSERT_L1(CY_HPPASS_CSG_SLICE_NUM_VALID(sliceIdx));

    /* Clear HW and FW Start bits */
    HPPASS_CSG_SLICE_DAC_MODE_START(HPPASS_BASE, sliceIdx) = 0UL;
}


/*******************************************************************************
* Function Name: Cy_HPPASS_DAC_SetValue
****************************************************************************//**
*
* Sets value for DAC buffered mode for the specified CSG slice.
*
* \param sliceIdx
* The CSG slice. Valid range: 0..4.
*
* \param value
* DAC value. Valid range: 0..1023.
*
* \note It could be used to update the only VAL_A register value in other DAC
* modes.
*
*******************************************************************************/
__STATIC_INLINE void Cy_HPPASS_DAC_SetValue(uint8_t sliceIdx, uint16_t value)
{
    CY_ASSERT_L1(CY_HPPASS_CSG_SLICE_NUM_VALID(sliceIdx));
    CY_ASSERT_L2(CY_HPPASS_CSG_DAC_VAL_VALID(value));

    HPPASS_CSG_SLICE_DAC_VAL_A(HPPASS_BASE, sliceIdx) = _VAL2FLD(HPPASS_CSG_SLICE_DAC_VAL_VALUE, value);
}


/*******************************************************************************
* Function Name: Cy_HPPASS_DAC_SetHystereticValues
****************************************************************************//**
*
* Set high and low values for DAC hysteretic mode for the specified CSG slice.
*
* \param sliceIdx
* The CSG slice. Valid range: 0..4.
*
* \param high
* High value. Valid range: 0..1023.
*
* \param low
* Low value. Valid range: 0..1023.
*
* \note This function is only for the DAC Hysteretic mode
*
*******************************************************************************/
__STATIC_INLINE void Cy_HPPASS_DAC_SetHystereticValues(uint8_t sliceIdx, uint16_t high, uint16_t low)
{
    CY_ASSERT_L1(CY_HPPASS_CSG_SLICE_NUM_VALID(sliceIdx));
    CY_ASSERT_L2(CY_HPPASS_CSG_DAC_VAL_VALID(high));
    CY_ASSERT_L2(CY_HPPASS_CSG_DAC_VAL_VALID(low));

    /* Set hysteretic high threshold value into DAC VAL_A buffer */
    HPPASS_CSG_SLICE_DAC_VAL_A(HPPASS_BASE, sliceIdx) =
        _VAL2FLD(HPPASS_CSG_SLICE_DAC_VAL_A_VALUE, high);

    /* Set hysteretic low threshold value into DAC VAL_B buffer */
    HPPASS_CSG_SLICE_DAC_VAL_B(HPPASS_BASE, sliceIdx) =
        _VAL2FLD(HPPASS_CSG_SLICE_DAC_VAL_B_VALUE, low);
}


