RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_hppass_csg.h
/*******************************************************************************
* Function Name: Cy_HPPASS_DAC_SetSlopeValues
****************************************************************************//**
*
* Set the start, stop, and step values for DAC slope mode for the specified CSG slice.
*
* \param sliceIdx
* The CSG slice. Valid range: 0..4.
*
* \param start
* Start value. Valid range: 0..1023.
*
* \param stop
* Stop value. Valid range: 0..1023.
*
* \param step
* Step value. Valid range: 1..64.
*
* \note This function is only for the DAC Slope mode
*
*******************************************************************************/
__STATIC_INLINE void Cy_HPPASS_DAC_SetSlopeValues(uint8_t sliceIdx, uint16_t start, uint16_t stop, uint8_t step)
{
    CY_ASSERT_L1(CY_HPPASS_CSG_SLICE_NUM_VALID(sliceIdx));
    CY_ASSERT_L2(CY_HPPASS_CSG_DAC_VAL_VALID(start));
    CY_ASSERT_L2(CY_HPPASS_CSG_DAC_VAL_VALID(stop));
    CY_ASSERT_L2(CY_HPPASS_CSG_DAC_STEP_VALID(step));

    /* Set DAC step value */
    CY_REG32_CLR_SET(HPPASS_CSG_SLICE_DAC_CFG(HPPASS_BASE, sliceIdx),
        HPPASS_CSG_SLICE_DAC_CFG_DAC_STEP, (uint32_t)step - 1UL);

    /* Set start value into DAC VAL_A buffer */
    HPPASS_CSG_SLICE_DAC_VAL_A(HPPASS_BASE, sliceIdx) =
        _VAL2FLD(HPPASS_CSG_SLICE_DAC_VAL_A_VALUE, start);

    /* Set stop value into DAC VAL_B buffer */
    HPPASS_CSG_SLICE_DAC_VAL_B(HPPASS_BASE, sliceIdx) =
        _VAL2FLD(HPPASS_CSG_SLICE_DAC_VAL_B_VALUE, stop);
}


/*******************************************************************************
* Function Name: Cy_HPPASS_DAC_SetLutAddress
****************************************************************************//**
*
* Sets the start and stop addresses, and step value for DAC LUT mode for the
* specified CSG slice.
*
* \param sliceIdx
* The CSG slice. Valid range: 0..4.
*
* \param start
* The start address (in LUT data words). Valid range: 0..127.
*
* \param stop
* The stop address (in LUT data words). Valid range: 0..127.
*
* \note start and stop parameter values are internally converted
* into the LUT physical register address values.
*
* \param step
* Step value (in LUT data words). Valid range: 1..64.
*
* \note This function is only for the DAC LUT mode
*
*******************************************************************************/
__STATIC_INLINE void Cy_HPPASS_DAC_SetLutAddress(uint8_t sliceIdx, uint8_t start, uint8_t stop, uint8_t step)
{
    CY_ASSERT_L1(CY_HPPASS_CSG_SLICE_NUM_VALID(sliceIdx));
    CY_ASSERT_L2(CY_HPPASS_CSG_LUT_ADDR_VALID(start));
    CY_ASSERT_L2(CY_HPPASS_CSG_LUT_ADDR_VALID(stop));
    CY_ASSERT_L2(CY_HPPASS_CSG_DAC_STEP_VALID(step));

    /* Set DAC step value */
    CY_REG32_CLR_SET(HPPASS_CSG_SLICE_DAC_CFG(HPPASS_BASE, sliceIdx),
        HPPASS_CSG_SLICE_DAC_CFG_DAC_STEP, (uint32_t)step - 1UL);

    /* Set start value into DAC VAL_A buffer */
    HPPASS_CSG_SLICE_DAC_VAL_A(HPPASS_BASE, sliceIdx) =
        _VAL2FLD(HPPASS_CSG_SLICE_DAC_VAL_A_VALUE, (uint32_t)start << 2U); /* convert to register address */

    /* Set stop value into DAC VAL_B buffer */
    HPPASS_CSG_SLICE_DAC_VAL_B(HPPASS_BASE, sliceIdx) =
        _VAL2FLD(HPPASS_CSG_SLICE_DAC_VAL_B_VALUE, (uint32_t)stop << 2U); /* convert to register address */
}


/** \} group_hppass_csg_dac */


/**
* \addtogroup group_hppass_csg_comp
* \{
*/


/*******************************************************************************
* Function Name: Cy_HPPASS_Comp_GetStatus
****************************************************************************//**
*
* Returns the comparator output state
*
* \param sliceIdx
* The CSG slice. Valid range: 0..4.
*
*******************************************************************************/
__STATIC_INLINE bool Cy_HPPASS_Comp_GetStatus(uint8_t sliceIdx)
{
    CY_ASSERT_L1(CY_HPPASS_CSG_SLICE_NUM_VALID(sliceIdx));

    return _FLD2BOOL(HPPASS_CSG_SLICE_CMP_STATUS_CMP_VAL, HPPASS_CSG_SLICE_CMP_STATUS(HPPASS_BASE, sliceIdx));
}

/** \} group_hppass_csg_comp */


/*******************************************************************************
* Function Name: Cy_HPPASS_DAC_GetInterruptStatus
****************************************************************************//**
*
* Gets the interrupt register status for the specified DAC.
*
* \return
* The status of combined interrupt requests for the DAC \ref group_csg_dac_interrupts.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_HPPASS_DAC_GetInterruptStatus(void)
{
    return HPPASS_CSG_DAC_INTR(HPPASS_BASE);
}


/*******************************************************************************
* Function Name: Cy_HPPASS_DAC_ClearInterrupt
****************************************************************************//**
*
* Clears the interrupt for the specified DAC.
*
* \param interrupt
* The mask of interrupts to clear. Each bit of this mask is responsible for
* clearing of the particular interrupt in the DAC \ref group_csg_dac_interrupts.
*
*******************************************************************************/
__STATIC_INLINE void Cy_HPPASS_DAC_ClearInterrupt(uint32_t interrupt)
{
    CY_ASSERT_L2(CY_HPPASS_MASK_VALID(interrupt, CY_HPPASS_INTR_CSG_DAC));

    HPPASS_CSG_DAC_INTR(HPPASS_BASE) = CY_HPPASS_INTR_CSG_DAC & interrupt;

    /* This dummy reading is necessary here. It provides a guarantee that
    * interrupt is cleared at returning from this function.
    */
    (void)HPPASS_CSG_DAC_INTR(HPPASS_BASE);
}


/*******************************************************************************
* Function Name: Cy_HPPASS_DAC_SetInterrupt
****************************************************************************//**
*
* Sets a software interrupt request for the specified DAC.
*
* \param interrupt
* The mask of interrupts to set. Each bit of this mask is responsible for
* triggering of the particular interrupt in the DAC \ref group_csg_dac_interrupts.
*
*******************************************************************************/
__STATIC_INLINE void Cy_HPPASS_DAC_SetInterrupt(uint32_t interrupt)
{
    CY_ASSERT_L2(CY_HPPASS_MASK_VALID(interrupt, CY_HPPASS_INTR_CSG_DAC));

