RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_hppass_csg.h
    HPPASS_CSG_DAC_INTR_SET(HPPASS_BASE) = CY_HPPASS_INTR_CSG_DAC & interrupt;
}


/*******************************************************************************
* Function Name: Cy_HPPASS_DAC_SetInterruptMask
****************************************************************************//**
*
* Enables the interrupt for the specified DAC.
*
* \param interrupt
* The mask of interrupts allowable for activation. Each bit of this mask
* allows triggering of the particular interrupt in the DAC
* \ref group_csg_dac_interrupts.
*
*******************************************************************************/
__STATIC_INLINE void Cy_HPPASS_DAC_SetInterruptMask(uint32_t interrupt)
{
    CY_ASSERT_L2(CY_HPPASS_MASK_VALID(interrupt, CY_HPPASS_INTR_CSG_DAC));

    HPPASS_CSG_DAC_INTR_MASK(HPPASS_BASE) = CY_HPPASS_INTR_CSG_DAC & interrupt;
}


/*******************************************************************************
* Function Name: Cy_HPPASS_DAC_GetInterruptMask
****************************************************************************//**
*
* Gets the interrupt mask for the specified DAC.
*
* \return
* The mask of the interrupts allowable for activation \ref group_csg_dac_interrupts.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_HPPASS_DAC_GetInterruptMask(void)
{
    return HPPASS_CSG_DAC_INTR_MASK(HPPASS_BASE);
}


/*******************************************************************************
* Function Name: Cy_HPPASS_DAC_GetInterruptStatusMasked
****************************************************************************//**
*
* Gets all DACs interrupt masked status.
*
* \return
* The masked status of combined interrupt requests for the DAC
* \ref group_csg_dac_interrupts.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_HPPASS_DAC_GetInterruptStatusMasked(void)
{
    return HPPASS_CSG_DAC_INTR_MASKED(HPPASS_BASE);
}


/*******************************************************************************
* Function Name: Cy_HPPASS_Comp_GetInterruptStatus
****************************************************************************//**
*
* Gets the interrupt register status for the specified comparator.
*
* \return
* The status of combined interrupt requests for the Comparator
* \ref group_csg_cmp_interrupts.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_HPPASS_Comp_GetInterruptStatus(void)
{
    return HPPASS_CSG_CMP_INTR(HPPASS_BASE);
}


/*******************************************************************************
* Function Name: Cy_HPPASS_Comp_ClearInterrupt
****************************************************************************//**
*
* Clears the interrupt for the specified comparator.
*
* \param interrupt
* The mask of interrupts to clear. Each bit of this mask is responsible for
* clearing of the particular interrupt in the Comparator
* \ref group_csg_cmp_interrupts.
*
*******************************************************************************/
__STATIC_INLINE void Cy_HPPASS_Comp_ClearInterrupt(uint32_t interrupt)
{
    CY_ASSERT_L2(CY_HPPASS_MASK_VALID(interrupt, CY_HPPASS_INTR_CSG_CMP));

    HPPASS_CSG_CMP_INTR(HPPASS_BASE) = CY_HPPASS_INTR_CSG_CMP & interrupt;

    /* This dummy reading is necessary here. It provides a guarantee that
    * interrupt is cleared at returning from this function.
    */
    (void)HPPASS_CSG_CMP_INTR(HPPASS_BASE);
}


/*******************************************************************************
* Function Name: Cy_HPPASS_Comp_SetInterrupt
****************************************************************************//**
*
* Sets a software interrupt request for the specified comparator.
*
* \param interrupt
* The mask of interrupts to set. Each bit of this mask is responsible for
* triggering of the particular interrupt in the Comparator
* \ref group_csg_cmp_interrupts.
*
*******************************************************************************/
__STATIC_INLINE void Cy_HPPASS_Comp_SetInterrupt(uint32_t interrupt)
{
    CY_ASSERT_L2(CY_HPPASS_MASK_VALID(interrupt, CY_HPPASS_INTR_CSG_CMP));

    HPPASS_CSG_CMP_INTR_SET(HPPASS_BASE) = CY_HPPASS_INTR_CSG_CMP & interrupt;
}


/*******************************************************************************
* Function Name: Cy_HPPASS_Comp_SetInterruptMask
****************************************************************************//**
*
* Enables the interrupt for the specified comparator.
*
* \param interrupt
* The mask of interrupts allowable for activation. Each bit of this mask
* allows triggering of the particular interrupt in the Comparator
* \ref group_csg_cmp_interrupts.
*
*******************************************************************************/
__STATIC_INLINE void Cy_HPPASS_Comp_SetInterruptMask(uint32_t interrupt)
{
    CY_ASSERT_L2(CY_HPPASS_MASK_VALID(interrupt, CY_HPPASS_INTR_CSG_CMP));

    HPPASS_CSG_CMP_INTR_MASK(HPPASS_BASE) = CY_HPPASS_INTR_CSG_CMP & interrupt;
}


/*******************************************************************************
* Function Name: Cy_HPPASS_Comp_GetInterruptMask
****************************************************************************//**
*
* Gets the interrupt mask for the specified comparator.
*
* \return
* The mask of the interrupts allowable for activation
* \ref group_csg_cmp_interrupts.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_HPPASS_Comp_GetInterruptMask(void)
{
    return HPPASS_CSG_CMP_INTR_MASK(HPPASS_BASE);
}


/*******************************************************************************
* Function Name: Cy_HPPASS_Comp_GetInterruptStatusMasked
****************************************************************************//**
*
* Gets all comparators interrupt masked status.
*
* \return
* The masked status of combined interrupt requests for the Comparator
* \ref group_csg_cmp_interrupts.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_HPPASS_Comp_GetInterruptStatusMasked(void)
{
    return HPPASS_CSG_CMP_INTR_MASKED(HPPASS_BASE);
}

/** \} group_hppass_csg_functions */

#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_MXS40MCPASS */

#endif /** !defined(CY_HPPASS_CSG_H) */

/** \} group_hppass_csg */

/* [] END OF FILE */
